// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// НЕ ИСПОЛЬЗОВАТЬ Math.Pow

// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

Console.WriteLine("Hello, World!");
