// Дана последовательность из N целых чисел и число K. Необходимо сдвинуть 
// всю последовательность (сдвиг - циклический) на |K| элементов вправо,
// если K – положительное и влево, если отрицательное.

Console.WriteLine("Hello, World!");
